results/ASPLOS/WILDFIRE/YCSB-ROCKSDB-CORUN-200sec/50M-KEYS/8/batchsize-512/ycsbwkldb/CII.out
Setting g_min_fd 3 
Setting g_min_fd 3 
RocksDB:    version 5.4
Date:       Sun Mar  3 21:33:36 2024
CPU:        128 * AMD EPYC 7543 32-Core Processor
CPUCache:   512 KB
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    50000000
Prefix:    20 bytes
Keys per prefix:    0
RawSize:    196266.2 MB (estimated)
FileSize:   98609.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Memtablerep: prefix_hash
Perf Level: 1
------------------------------------------------
DB path: [/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA]
ycsbwkldb    :       4.347 micros/op 230064 ops/sec; ( reads:5459144 writes:287855 total:50000000 found:5459144)
	Command being timed: "/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/db_bench --db=/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA --num_levels=6 --key_size=20 --prefix_size=20 --memtablerep=prefix_hash --bloom_bits=10 --bloom_locality=1 --use_existing_db=1 --num=50000000 --duration=200 --compression_type=none --value_size=4096 --threads=8 --benchmarks=ycsbwkldb --use_existing_db=1 --mmap_read=0 --threads=8"
	User time (seconds): 495.26
	System time (seconds): 389.77
	Percent of CPU this job got: 434%
	Elapsed (wall clock) time (h:mm:ss or m:ss): 3:23.85
	Average shared text size (kbytes): 0
	Average unshared data size (kbytes): 0
	Average stack size (kbytes): 0
	Average total size (kbytes): 0
	Maximum resident set size (kbytes): 2029012
	Average resident set size (kbytes): 0
	Major (requiring I/O) page faults: 74
	Minor (reclaiming a frame) page faults: 5427562
	Voluntary context switches: 8499674
	Involuntary context switches: 2167
	Swaps: 0
	File system inputs: 154558184
	File system outputs: 197630536
	Socket messages sent: 0
	Socket messages received: 0
	Signals delivered: 0
	Page size (bytes): 4096
	Exit status: 0
[83751.639675] sh (252729): drop_caches: 3
[83751.737827] sh (252736): drop_caches: 3
[83785.972276] write_proc_unbounded: Value of write = 1
[83785.972292] write_proc_2mb_limit: Value of write = 1
[83785.972297] write_proc_bitmap_shift: Value of write = 38
[83785.980712] write_proc_unbounded: Value of write = 1
[83785.980724] write_proc_2mb_limit: Value of write = 1
[83785.980728] write_proc_bitmap_shift: Value of write = 38
[83786.768207] write_proc_unbounded: Value of write = 0
[83786.768219] write_proc_2mb_limit: Value of write = 0
[83786.768309] write_proc_unbounded: Value of write = 0
[83786.768327] write_proc_2mb_limit: Value of write = 0
[83786.768517] write_proc_unbounded: Value of write = 0
[83786.768532] write_proc_2mb_limit: Value of write = 0
[83786.768645] write_proc_unbounded: Value of write = 0
[83786.768666] write_proc_2mb_limit: Value of write = 0
[83786.768951] write_proc_unbounded: Value of write = 0
[83786.768965] write_proc_2mb_limit: Value of write = 0
[83786.769035] write_proc_unbounded: Value of write = 0
[83786.769046] write_proc_2mb_limit: Value of write = 0
[83786.769145] write_proc_unbounded: Value of write = 0
[83786.769154] write_proc_2mb_limit: Value of write = 0
[83786.769194] write_proc_unbounded: Value of write = 0
[83786.769200] write_proc_2mb_limit: Value of write = 0
[83786.769455] write_proc_unbounded: Value of write = 0
[83786.769465] write_proc_2mb_limit: Value of write = 0
[83786.769480] write_proc_unbounded: Value of write = 0
[83786.769488] write_proc_2mb_limit: Value of write = 0
[83786.769546] write_proc_unbounded: Value of write = 0
[83786.769556] write_proc_2mb_limit: Value of write = 0
[83786.769924] write_proc_unbounded: Value of write = 0
[83786.769943] write_proc_2mb_limit: Value of write = 0
[83786.769955] write_proc_unbounded: Value of write = 0
[83786.769962] write_proc_2mb_limit: Value of write = 0
[83786.770234] write_proc_unbounded: Value of write = 0
[83786.770242] write_proc_2mb_limit: Value of write = 0
[83786.770263] write_proc_unbounded: Value of write = 0
[83786.770270] write_proc_2mb_limit: Value of write = 0
[83786.770501] write_proc_unbounded: Value of write = 0
[83786.770507] write_proc_2mb_limit: Value of write = 0
[83786.770720] write_proc_unbounded: Value of write = 0
[83786.770725] write_proc_unbounded: Value of write = 0
[83786.770727] write_proc_2mb_limit: Value of write = 0
[83786.770738] write_proc_2mb_limit: Value of write = 0
[83786.771122] write_proc_unbounded: Value of write = 0
[83786.771129] write_proc_2mb_limit: Value of write = 0
[83786.771137] write_proc_unbounded: Value of write = 0
[83786.771143] write_proc_2mb_limit: Value of write = 0
[83786.771413] write_proc_unbounded: Value of write = 0
[83786.771419] write_proc_2mb_limit: Value of write = 0
[83786.771722] write_proc_unbounded: Value of write = 0
[83786.771728] write_proc_2mb_limit: Value of write = 0
[83786.772213] write_proc_unbounded: Value of write = 0
[83786.772219] write_proc_2mb_limit: Value of write = 0
[83786.772233] write_proc_unbounded: Value of write = 0
[83786.772240] write_proc_2mb_limit: Value of write = 0
[83786.772661] write_proc_unbounded: Value of write = 0
[83786.772668] write_proc_2mb_limit: Value of write = 0
[83786.773364] write_proc_unbounded: Value of write = 0
[83786.773377] write_proc_2mb_limit: Value of write = 0
[83786.773524] write_proc_unbounded: Value of write = 0
[83786.773530] write_proc_2mb_limit: Value of write = 0
[83786.773813] write_proc_unbounded: Value of write = 0
[83786.773819] write_proc_2mb_limit: Value of write = 0
[83786.773829] write_proc_unbounded: Value of write = 0
[83786.773834] write_proc_2mb_limit: Value of write = 0
[83786.774032] write_proc_unbounded: Value of write = 0
[83786.774040] write_proc_2mb_limit: Value of write = 0
[83786.774186] write_proc_unbounded: Value of write = 0
[83786.774191] write_proc_2mb_limit: Value of write = 0
[83786.774747] write_proc_unbounded: Value of write = 0
[83786.774752] write_proc_2mb_limit: Value of write = 0
[83989.678882] write_proc_unbounded: Value of write = 0
[83989.678896] write_proc_2mb_limit: Value of write = 0
[83989.825532] write_proc_unbounded: Value of write = 0
[83989.825551] write_proc_2mb_limit: Value of write = 0