results/ASPLOS/WILDFIRE/YCSB-ROCKSDB-CORUN-200sec/50M-KEYS/8/batchsize-512/ycsbwkldb/CIPI_PERF.out
Setting g_min_fd 4 
Setting g_min_fd 4 
RocksDB:    version 5.4
Date:       Sun Mar  3 20:18:29 2024
CPU:        128 * AMD EPYC 7543 32-Core Processor
CPUCache:   512 KB
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    50000000
Prefix:    20 bytes
Keys per prefix:    0
RawSize:    196266.2 MB (estimated)
FileSize:   98609.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Memtablerep: prefix_hash
Perf Level: 1
------------------------------------------------
DB path: [/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA]
ycsbwkldb    :       3.819 micros/op 261818 ops/sec; ( reads:6071962 writes:320037 total:50000000 found:6071962)
	Command being timed: "/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/db_bench --db=/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA --num_levels=6 --key_size=20 --prefix_size=20 --memtablerep=prefix_hash --bloom_bits=10 --bloom_locality=1 --use_existing_db=1 --num=50000000 --duration=200 --compression_type=none --value_size=4096 --threads=8 --benchmarks=ycsbwkldb --use_existing_db=1 --mmap_read=0 --threads=8"
	User time (seconds): 496.16
	System time (seconds): 330.70
	Percent of CPU this job got: 396%
	Elapsed (wall clock) time (h:mm:ss or m:ss): 3:28.52
	Average shared text size (kbytes): 0
	Average unshared data size (kbytes): 0
	Average stack size (kbytes): 0
	Average total size (kbytes): 0
	Maximum resident set size (kbytes): 1922104
	Average resident set size (kbytes): 0
	Major (requiring I/O) page faults: 2798
	Minor (reclaiming a frame) page faults: 5124760
	Voluntary context switches: 22937945
	Involuntary context switches: 3446
	Swaps: 0
	File system inputs: 165521616
	File system outputs: 206273800
	Socket messages sent: 0
	Socket messages received: 0
	Signals delivered: 0
	Page size (bytes): 4096
	Exit status: 0
[79240.572101] sh (235231): drop_caches: 3
[79240.640055] sh (235240): drop_caches: 3
[79274.825569] write_proc_unbounded: Value of write = 1
[79274.825578] write_proc_2mb_limit: Value of write = 1
[79274.825582] write_proc_bitmap_shift: Value of write = 38
[79274.830664] write_proc_unbounded: Value of write = 1
[79274.830674] write_proc_2mb_limit: Value of write = 1
[79274.830678] write_proc_bitmap_shift: Value of write = 38
[79483.217938] write_proc_unbounded: Value of write = 0
[79483.217947] write_proc_2mb_limit: Value of write = 0
[79483.350908] write_proc_unbounded: Value of write = 0
[79483.350917] write_proc_2mb_limit: Value of write = 0